export const ErrorsApp = {
  ERROR_FORBIDDEN: 'Доступ до цієї функції Вам забороно',
  EMPTY_NAME: 'Поле ім`я повинне бути заповнене!',
  NOT_VALID_EMAIL:
    'Ви ввели не валідний формат email адреси. Ввведіть email адресу в форматі user@example.com!',
  NOT_VALID_PHONE:
    'Введіть будь ласка Ваш номер телефону у форматі +380XXXXXXXXX!',
  NOT_VALID_PASSWORD:
    'Пароль має містити принаймні 6 символів та в його складі має бути принаймні одна літера та один спеціальний символ (*, #, & тощо)!',
  EMPTY_USER: 'Такого користувача не існує!',
  EXIST_USER: 'Email вже використовується іншим користувачем',
  BAD_PASSWORD: 'Невірний пароль! Спробуйте ще!',
  NOT_PRICE: 'Таккї позиції прайсу не існує!',
  NOT_PROJECT: 'Такого кошторису не існує!',

  NOT_VERIFICATION(emailVer) {
    return `Користувач з email ${emailVer} не підтвердив своєї реєстрації! Перейдіть будь ласка на свою електронну скриньку для підтвердження реєстрації!`;
  },
};
